#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.assume_role: Reading...
aws_iam_role.iam_role_eks_node_group: Refreshing state... [id=earth-dev-eks-node-group-role]
aws_eip.eip_01: Refreshing state... [id=eipalloc-0d53fe2f4acc7e626]
aws_eip.eip_02: Refreshing state... [id=eipalloc-0bb808143bbeb68c6]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3552664922]
aws_vpc.vpc: Refreshing state... [id=vpc-0b21c263220ed2b4a]
aws_iam_role.iam_role_eks: Refreshing state... [id=earth-dev-eks-cluster-role]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-eks-cluster-role-20231010100726217000000001]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=earth-dev-eks-node-group-role-20231010100726352300000003]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=earth-dev-eks-node-group-role-20231010100726435400000005]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-eks-cluster-role-20231010100726294700000002]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=earth-dev-eks-node-group-role-20231010100726419800000004]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-09a13b8c8e159081f]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-0270345d1eaaa742d]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-0387b049688ea5d58]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0713001472b06e72f]
aws_security_group.cluster_sg: Refreshing state... [id=sg-0c3240de0c7139a49]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-0f5c17b78088d470c]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-06d9c588f6a6b2f53]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0cab1402be96f1183]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-02d32188250d807cc]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-02ad8b0d1f47f3ad0]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-0686ad6aa3f75931b]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-06be79428d0082e7b]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-06cb5d218eb6e24b5]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-0c3d91b1b65cd8178]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-0a48460048e08c478]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "earth-dev"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::318374019075:role/earth-dev-eks-cluster-role"
      + status                = (known after apply)
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
      + version               = "1.28"

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "119.196.97.40/32",
            ]
          + security_group_ids        = [
              + "sg-0c3240de0c7139a49",
            ]
          + subnet_ids                = [
              + "subnet-09a13b8c8e159081f",
              + "subnet-0f5c17b78088d470c",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.app_node_group will be created
  + resource "aws_eks_node_group" "app_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "earth-dev"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "app-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::318374019075:role/earth-dev-eks-node-group-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-09a13b8c8e159081f",
          + "subnet-0f5c17b78088d470c",
        ]
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*